Wang-Nainai/SmartKnob/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
# ---- CPU ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_160=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=160
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
# 堆投毒(全面): 越界写在其所属块 free 时立即报出肇事地址, 抓内存踩踏
CONFIG_HEAP_POISONING_COMPREHENSIVE=y
CONFIG_MOTOR_ENABLE=y
CONFIG_MOTOR_PWM_A=15
CONFIG_MOTOR_PWM_B=16
CONFIG_MOTOR_PWM_C=17
CONFIG_MOTOR_EN_PIN=18
CONFIG_MOTOR_MT6701_INTERFACE_ABZ=y
CONFIG_MOTOR_MT6701_ABZ_A_PIN=7
CONFIG_MOTOR_MT6701_ABZ_B_PIN=4
CONFIG_MOTOR_MT6701_ABZ_PPR=1024
CONFIG_MOTOR_POLE_PAIRS=7
CONFIG_MOTOR_VOLTAGE_SUPPLY=12
CONFIG_MOTOR_VOLTAGE_LIMIT=5
CONFIG_MOTOR_TASK_CORE=1
# ---- SCD40 ----
CONFIG_SCD40_SDA_PIN=5
CONFIG_SCD40_SCL_PIN=6
CONFIG_SCD40_POLL_INTERVAL_MS=2000
CONFIG_SCD40_I2C_SPEED_HZ=100000
CONFIG_MQTT_HA_ENABLE=y
CONFIG_MQTT_HA_TOPIC="knob"
CONFIG_WEBCFG_ENABLE=y
CONFIG_WEBCFG_HTTP_PORT=80
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_DEPTH=16
CONFIG_LV_MEM_SIZE_KILOBYTES=64
# LVGL 用 stdlib malloc: 内部 RAM 优先, 满了自动落 PSRAM
# (builtin 固定 64KB 池不可扩展, 页面叠加时 OOM 死循环)
CONFIG_LV_USE_STDLIB_MALLOC=y
CONFIG_LV_FONT_MONTSERRAT_8=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_USE_SCALE=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_OS=0
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=6
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# BLE HID 真正连上后 NimBLE 运行期分配会吃穿内部 RAM(WiFi 发帧
# 分配失败 TCP 重传死循环, web 全瘫) —— BLE 栈与 WiFi/lwip 动态
# 缓冲都放 PSRAM(S3 GDMA 支持)
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_TOUCH_SWAP_XY=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
